[
    {
        "id": 1,
        "title": "Software Developer",
        "location": "Farmington Hills, MI",
        "company": "Contracting | Freelance",
        "start": "May 2024",
        "end": "Present",
        "description": [
            "I design, develop, and deploy responsive mobile and web applications that solve real-world problems for personal, family, and small business use. Collaborating closely with users, I translate feedback into intuitive, feature-rich solutions built with React, HTML, CSS, JavaScript, and Firebase. I also manage post-deployment maintenance—debugging, optimizing performance, and refining functionality to ensure smooth, scalable performance."
        ]
    },
    {
        "id": 2,
        "title": "Software Developer",
        "location": "Southfield, MI",
        "company": "BkRobs Consulting",
        "start": "Oct 2024",
        "end": "Present",
        "description": [
            "I contributed to the development of a digital portal for a property and casualty insurance company, enhancing internal processes and customer satisfaction. Working in an Agile environment, I participated in Scrum meetings and iterative development cycles, managing deliverables via SharePoint. Using React, HTML, CSS, JavaScript, and MySQL, I designed responsive, scalable solutions that improved system usability, following the product company’s established best practices and standards."
        ]
    },
    {
        "id": 3,
        "title": "Python Tutor",
        "location": "Lansing, MI",
        "company": "SpartanTutors",
        "start": "September 2023",
        "end": "April 2024",
        "description": [
            "I tutored first-year Michigan State University students in foundational Python programming, delivering personalized one-on-one and small group sessions to strengthen coding skills and problem-solving strategies. I created custom examples and exercises covering classes, functions, data structures, and string manipulation, while managing weekly schedules to ensure consistent, engaging, and effective learning experiences."
        ],
        "skills": [
            "Communication",
            "Python",
            "Time Management"
        ]
    },
    {
        "id": 4,
        "title": "Software Developer",
        "location": "East Lansing, MI",
        "company": "Ally Financial",
        "start": "August 2023",
        "end": "December 2023",
        "description": [
            "I collaborated with a team of four to design and develop Money Moves, a mobile web app for Ally Financial that promotes financial literacy for over 11 million customers. I built responsive, accessible UI/UX components using React, JavaScript, HTML, and CSS, and translated requirements from the senior software team into functional modules like mortgage and interest calculators and interactive course quizzes. I also delivered structured business presentations to stakeholders, showcasing design choices, technical progress, and measurable outcomes."
        ],
        "skills": [
            "JavaScript",
            "Python",
            "HTML",
            "CSS",
            "MaterialUI",
            "SQL"
        ]
    }
]